{
    "architectures": [
        "MiMoForCausalLM"
    ],
    "tokenizer_class":[
        "Qwen2Tokenizer"
    ],
    "attention_bias": true,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 32768,
    "max_window_layers": 36,
    "model_type": "mimo",
    "num_attention_heads": 32,    
    "num_hidden_layers": 36,
    "num_key_value_heads": 8,
    "num_nextn_predict_layers": 1,
    "num_speculative_steps": 3,
    "mtp_loss_step_weights": [0.51,0.31,0.18],
    "ntp_loss_weight": 0.0,
    "mtp_loss_weight": 1.0,
    "rms_norm_eps": 1e-05,
    "rope_theta": 640000,
    "sliding_window": 32768,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.40.1",
    "use_cache": true,
    "use_mrope": false,
    "use_sliding_window": false,
    "vocab_size": 151680
}
